In [1]:
import sqlite3

In [2]:
# Creating the Database
db = sqlite3.connect('Employee.sqlite')

In [3]:
# Creating cursor to implement and execute the sql query
cur = db.cursor()

In [4]:
cur.execute('CREATE TABLE Employee_Table (Employee_ID int Primary key, Name text, Age int, Department text, Salary int)')

In [6]:
db.commit()

In [9]:
cur.execute('INSERT INTO Employee_Table values (100,"Rishab", 25,"Marketing", 50000)')

In [10]:
cur.execute('INSERT INTO Employee_Table values (101,"Aman", 23,"Data Scientist", 500000)')
cur.execute('INSERT INTO Employee_Table values (102,"Abhishek", 26,"HR", 50000)')

In [11]:
db.commit()

In [4]:
RollNo = 103
Name = "Ashish"
Age = 27
Occupation = "Chef"
Salary = 500000
cur.execute('Insert into Employee_Table values (?,?,?,?,?)',(RollNo,Name,Age,Occupation,Salary))

In [5]:
db.commit()

In [6]:
values = [(104,"Rohit",23,"SDE",5200000),(105,"Viren",23,"SDE",5500000)]
cur.executemany('insert into Employee_Table values (?,?,?,?,?)',values)

In [7]:
db.commit()

In [8]:
cur.execute('Delete from Employee_Table where Employee_ID = 101')

In [9]:
db.commit()

In [11]:
cur.execute('Delete from Employee_Table')

In [12]:
db.commit()

In [13]:
employee_id=[101,102,103,104,105,106,107,108,109,110,111,112]
name=['Aadarsh','Aarti','Siddharth','Aman','Amit','Shivansh','Vaibhav','Himanshu','Raman','Kunal','Adhira','Tanya']
age=[25,27,25,24,30,26,23,26,25,26,29,24]
department=['Marketing','Operations','Finance','Human Resource','Marketing','IT','Finance','IT','Operations','Marketing','Human Resource','Marketing']
salary=[50000,60000,85000,75000,50000,90000,85000,90000,60000,50000,75000,50000]

for i in range(0,len(employee_id)):
    cur.execute('Insert into Employee_Table values(?,?,?,?,?)',(employee_id[i],name[i],age[i],department[i],salary[i]))

In [14]:
db.commit()

In [15]:
cur.execute('Select * from Employee_Table')

In [16]:
for row in cur:
    print(row)

(101, 'Aadarsh', 25, 'Marketing', 50000)
(102, 'Aarti', 27, 'Operations', 60000)
(103, 'Siddharth', 25, 'Finance', 85000)
(104, 'Aman', 24, 'Human Resource', 75000)
(105, 'Amit', 30, 'Marketing', 50000)
(106, 'Shivansh', 26, 'IT', 90000)
(107, 'Vaibhav', 23, 'Finance', 85000)
(108, 'Himanshu', 26, 'IT', 90000)
(109, 'Raman', 25, 'Operations', 60000)
(110, 'Kunal', 26, 'Marketing', 50000)
(111, 'Adhira', 29, 'Human Resource', 75000)
(112, 'Tanya', 24, 'Marketing', 50000)

In [18]:
cur.execute('select * from Employee_Table')
ans = cur.fetchmany(3)
ans

[(101, 'Aadarsh', 25, 'Marketing', 50000),
 (102, 'Aarti', 27, 'Operations', 60000),
 (103, 'Siddharth', 25, 'Finance', 85000)]

In [20]:
cur.execute('select * from Employee_Table')
ans = cur.fetchall()
ans

[(101, 'Aadarsh', 25, 'Marketing', 50000),
 (102, 'Aarti', 27, 'Operations', 60000),
 (103, 'Siddharth', 25, 'Finance', 85000),
 (104, 'Aman', 24, 'Human Resource', 75000),
 (105, 'Amit', 30, 'Marketing', 50000),
 (106, 'Shivansh', 26, 'IT', 90000),
 (107, 'Vaibhav', 23, 'Finance', 85000),
 (108, 'Himanshu', 26, 'IT', 90000),
 (109, 'Raman', 25, 'Operations', 60000),
 (110, 'Kunal', 26, 'Marketing', 50000),
 (111, 'Adhira', 29, 'Human Resource', 75000),
 (112, 'Tanya', 24, 'Marketing', 50000)]

In [21]:
cur.execute('select * from Employee_Table')
ans = cur.fetchone()
ans

(101, 'Aadarsh', 25, 'Marketing', 50000)

In [38]:
db.close()